; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-23)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 room3)
(at ball10 room3)
(at ball11 room5)
(at ball12 room5)
(at ball13 room5)
(at ball14 room5)
(at ball15 room5)
(at ball16 room5)
(at ball17 room5)
(at ball18 room5)
(at ball19 room6)
(at ball20 room6)
(at ball21 room6)
(at ball22 room6)
(at ball23 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room5)
(at ball21 room6)
(at ball22 room6)
(at ball23 room6)
)
)
)

; plan
1. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 8 of 23
2. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 8 of 23
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 8 of 23
4. (drop ball4 roomb right)
   deleted: (carry ball4 right)
   added: (at ball4 roomb) (free right)
   goals met: 9 of 23
5. (drop ball5 roomb left)
   deleted: (carry ball5 left)
   added: (at ball5 roomb) (free left)
   goals met: 10 of 23
6. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 10 of 23
7. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 10 of 23
8. (drop ball8 room3 left)
   deleted: (carry ball8 left)
   added: (at ball8 room3) (free left)
   goals met: 11 of 23
9. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 11 of 23
10. (pick ball20 room6 left)
   deleted: (at ball20 room6) (free left)
   added: (carry ball20 left)
   goals met: 11 of 23
11. (pick ball19 room6 right)
   deleted: (at ball19 room6) (free right)
   added: (carry ball19 right)
   goals met: 11 of 23
12. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 11 of 23
13. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 11 of 23
14. (drop ball20 room5 left)
   deleted: (carry ball20 left)
   added: (at ball20 room5) (free left)
   goals met: 12 of 23
15. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 12 of 23
16. (drop ball19 room4 right)
   deleted: (carry ball19 right)
   added: (at ball19 room4) (free right)
   goals met: 13 of 23
17. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 13 of 23
18. (pick ball18 room5 left)
   deleted: (at ball18 room5) (free left)
   added: (carry ball18 left)
   goals met: 13 of 23
19. (pick ball17 room5 right)
   deleted: (at ball17 room5) (free right)
   added: (carry ball17 right)
   goals met: 13 of 23
20. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 13 of 23
21. (drop ball17 room4 right)
   deleted: (carry ball17 right)
   added: (at ball17 room4) (free right)
   goals met: 14 of 23
22. (drop ball18 room4 left)
   deleted: (carry ball18 left)
   added: (at ball18 room4) (free left)
   goals met: 15 of 23
23. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 15 of 23
24. (pick ball16 room5 left)
   deleted: (at ball16 room5) (free left)
   added: (carry ball16 left)
   goals met: 15 of 23
25. (pick ball15 room5 right)
   deleted: (at ball15 room5) (free right)
   added: (carry ball15 right)
   goals met: 15 of 23
26. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 15 of 23
27. (drop ball15 room4 right)
   deleted: (carry ball15 right)
   added: (at ball15 room4) (free right)
   goals met: 16 of 23
28. (drop ball16 room4 left)
   deleted: (carry ball16 left)
   added: (at ball16 room4) (free left)
   goals met: 17 of 23
29. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 17 of 23
30. (pick ball14 room5 left)
   deleted: (at ball14 room5) (free left)
   added: (carry ball14 left)
   goals met: 17 of 23
31. (pick ball13 room5 right)
   deleted: (at ball13 room5) (free right)
   added: (carry ball13 right)
   goals met: 17 of 23
32. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 17 of 23
33. (drop ball13 room4 right)
   deleted: (carry ball13 right)
   added: (at ball13 room4) (free right)
   goals met: 18 of 23
34. (drop ball14 room4 left)
   deleted: (carry ball14 left)
   added: (at ball14 room4) (free left)
   goals met: 19 of 23
35. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 19 of 23
36. (pick ball12 room5 left)
   deleted: (at ball12 room5) (free left)
   added: (carry ball12 left)
   goals met: 19 of 23
37. (pick ball11 room5 right)
   deleted: (at ball11 room5) (free right)
   added: (carry ball11 right)
   goals met: 19 of 23
38. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 19 of 23
39. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 19 of 23
40. (drop ball12 room4 left)
   deleted: (carry ball12 left)
   added: (at ball12 room4) (free left)
   goals met: 20 of 23
41. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 20 of 23
42. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 20 of 23
43. (drop ball11 room3 right)
   deleted: (carry ball11 right)
   added: (at ball11 room3) (free right)
   goals met: 21 of 23
44. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 21 of 23
45. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 21 of 23
46. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 21 of 23
47. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 21 of 23
48. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 21 of 23
49. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 22 of 23
50. (drop ball2 roomb right)
   deleted: (carry ball2 right)
   added: (at ball2 roomb) (free right)
   goals met: 23 of 23
